Repository: strawberryfield/BBS
Catalog: locale/*/LC_MESSAGES/BBS.UI.po
Languages: it

source: Old password
it: Vecchia password

source: New password
it: Nuova password

source: Password incorrect. Try again.
it: Password errata. Riprova.

source: Retype password
it: Riscrivi la password

source: Password do not meet security criteria.
it: La password non soddisfa i criteri di sicurezza.

source: Password changed successfully.
it: Password correttamente modificata.

source: The two passwords do not match.
it: Le due password sono diverse.

source: Username
it: Nome utente

source: User '{0}' is not found.
it: Utente '{0}' non trovato.

source: GUEST
it: OSPITE

source: Username or password incorrect. Please try again.
it: Utente o password errati. Riprova.

source: Yes
it: Si

source: This name is already in use. Try another.
it: Nome utente gia' utilizzato. Prova con un altro.

source: Confirm password
it: Conferma la password

source: Your real name
it: Il tuo vero nome

source: The two passwords do not match. Try again.
it: Le due password sono diverse. Riprova.

source: Your city
it: La tua citta'

source: Your country
it: La tua nazione

source: Confirm new user creation? [{0}]/{1}
it: Confermi la creazione dell'utente? [{0}]/{1}

source: Created new user '{0}'
it: Creato il nuovo utente '{0}'
